Revit 2026 API

# ReferenceIntersectorGetFilter Method

---

Gets the ElementFilter used in intersection testing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementFilter GetFilter()
```
```vb
Public Function GetFilter As ElementFilter
```
```cpp
public:
ElementFilter^ GetFilter()
```
```fsharp
member GetFilter : unit -> ElementFilter
```

#### Return Value

ElementFilter The ElementFilter, or  if no filter is set.

#### Reference

ReferenceIntersector Class

Autodesk.Revit.DB Namespace